"""
ผู้ที่ได้คะแนนตั้งแต่ 90 คะแนนขึ้นไปจะได้เกรด A
ผู้ที่ได้คะแนนตั้งแต่ 85 - 89 จะได้เกรด B+
ผู้ที่ได้คะแนนตั้งแต่ 80 - 84 จะได้เกรด B
ผู้ที่ได้คะแนนตั้งแต่ 75 - 79 จะได้เกรด C+
ผู้ที่ได้คะแนนตั้งแต่ 70 - 74 จะได้เกรด C
ผู้ที่ได้คะแนนตั้งแต่ 65 - 69 จะได้เกรด D+
ผู้ที่ได้คะแนนตั้งแต่ 60 - 64 จะได้เกรด D
ผู้ที่ได้คะแนนต่ำกว่า 60 ลงไปจะได้เกรด F
"""

A = int(input())

def calculat_grade(n):
  B="FFFfFFDCBA"
  return B[n//10]
if calculat_grade(A) == "A":
  print("A")
else:
  #เงื่อนไขแบบย่อ
  print(calculat_grade(A)+"+") if A%10 >= 5 else print(calculat_grade(A))